tests/performance/result_report/statistics.json
{
  "get_balance_for_coin_by_block 1" : {
    "transaction" : "get_balance_for_coin_by_block 1",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 74.27499999999998,
    "medianResTime" : 43.0,
    "minResTime" : 25.0,
    "maxResTime" : 1303.0,
    "pct1ResTime" : 76.90000000000003,
    "pct2ResTime" : 87.94999999999999,
    "pct3ResTime" : 1077.0,
    "throughput" : 21.808268968650612,
    "receivedKBytesPerSec" : 443.72586324398,
    "sentKBytesPerSec" : 4.770558836892321
  },
  "get_balance_for_coin_by_time 2" : {
    "transaction" : "get_balance_for_coin_by_time 2",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 168.85624999999976,
    "medianResTime" : 151.5,
    "minResTime" : 94.0,
    "maxResTime" : 1228.0,
    "pct1ResTime" : 180.0,
    "pct2ResTime" : 188.95,
    "pct3ResTime" : 1204.71,
    "throughput" : 9.879592466810744,
    "receivedKBytesPerSec" : 7883.557811052794,
    "sentKBytesPerSec" : 2.4506020376659463
  },
  "get_balance_for_coin_by_block 2" : {
    "transaction" : "get_balance_for_coin_by_block 2",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 68.29166666666667,
    "medianResTime" : 44.0,
    "minResTime" : 26.0,
    "maxResTime" : 1102.0,
    "pct1ResTime" : 77.0,
    "pct2ResTime" : 90.89999999999998,
    "pct3ResTime" : 1061.1399999999999,
    "throughput" : 21.84399745153363,
    "receivedKBytesPerSec" : 532.1487894784746,
    "sentKBytesPerSec" : 4.778374442522981
  },
  "get_balance_for_coin_by_time 1" : {
    "transaction" : "get_balance_for_coin_by_time 1",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 165.58541666666687,
    "medianResTime" : 143.5,
    "minResTime" : 91.0,
    "maxResTime" : 1404.0,
    "pct1ResTime" : 177.0,
    "pct2ResTime" : 186.95,
    "pct3ResTime" : 1198.47,
    "throughput" : 9.874308284133221,
    "receivedKBytesPerSec" : 7125.036642940899,
    "sentKBytesPerSec" : 2.4492913126658578
  },
  "get_balance_for_coin_by_block 5" : {
    "transaction" : "get_balance_for_coin_by_block 5",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 67.44374999999992,
    "medianResTime" : 41.0,
    "minResTime" : 24.0,
    "maxResTime" : 1091.0,
    "pct1ResTime" : 76.0,
    "pct2ResTime" : 87.0,
    "pct3ResTime" : 1059.95,
    "throughput" : 21.78649237472767,
    "receivedKBytesPerSec" : 450.83571623093684,
    "sentKBytesPerSec" : 4.914726307189542
  },
  "find_matching_accounts 7" : {
    "transaction" : "find_matching_accounts 7",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.90833333333333,
    "medianResTime" : 133.5,
    "minResTime" : 75.0,
    "maxResTime" : 1302.0,
    "pct1ResTime" : 241.80000000000007,
    "pct2ResTime" : 262.0,
    "pct3ResTime" : 1178.8799999999999,
    "throughput" : 6.206682528188683,
    "receivedKBytesPerSec" : 3.1518309713458157,
    "sentKBytesPerSec" : 1.0546511327195613
  },
  "get_balance_for_coin_by_time 5" : {
    "transaction" : "get_balance_for_coin_by_time 5",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 149.10208333333344,
    "medianResTime" : 141.0,
    "minResTime" : 82.0,
    "maxResTime" : 1216.0,
    "pct1ResTime" : 177.0,
    "pct2ResTime" : 186.0,
    "pct3ResTime" : 391.13999999999794,
    "throughput" : 9.890789202555121,
    "receivedKBytesPerSec" : 7163.529646610344,
    "sentKBytesPerSec" : 2.4533793529775396
  },
  "find_matching_accounts 6" : {
    "transaction" : "find_matching_accounts 6",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.32291666666666,
    "medianResTime" : 143.0,
    "minResTime" : 76.0,
    "maxResTime" : 1282.0,
    "pct1ResTime" : 245.80000000000007,
    "pct2ResTime" : 262.0,
    "pct3ResTime" : 300.38,
    "throughput" : 6.205077822017684,
    "receivedKBytesPerSec" : 5.041625730389369,
    "sentKBytesPerSec" : 1.0483188117275972
  },
  "get_balance_for_coin_by_block 3" : {
    "transaction" : "get_balance_for_coin_by_block 3",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 58.331250000000026,
    "medianResTime" : 42.0,
    "minResTime" : 25.0,
    "maxResTime" : 1069.0,
    "pct1ResTime" : 75.90000000000003,
    "pct2ResTime" : 84.94999999999999,
    "pct3ResTime" : 1036.8,
    "throughput" : 21.788470267816614,
    "receivedKBytesPerSec" : 444.15285973672263,
    "sentKBytesPerSec" : 4.766227871084884
  },
  "get_balance_for_coin_by_time 4" : {
    "transaction" : "get_balance_for_coin_by_time 4",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.44583333333333,
    "medianResTime" : 144.0,
    "minResTime" : 84.0,
    "maxResTime" : 1217.0,
    "pct1ResTime" : 178.0,
    "pct2ResTime" : 183.0,
    "pct3ResTime" : 1154.38,
    "throughput" : 9.880405920009881,
    "receivedKBytesPerSec" : 7052.332702085177,
    "sentKBytesPerSec" : 2.4508038121899505
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 8640,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 133.04421296296337,
    "medianResTime" : 119.0,
    "minResTime" : 24.0,
    "maxResTime" : 1571.0,
    "pct1ResTime" : 203.0,
    "pct2ResTime" : 250.0,
    "pct3ResTime" : 1066.5900000000001,
    "throughput" : 110.63873380115761,
    "receivedKBytesPerSec" : 23298.5713165241,
    "sentKBytesPerSec" : 22.629558725605698
  },
  "get_balance_for_coin_by_block 4" : {
    "transaction" : "get_balance_for_coin_by_block 4",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 58.91041666666666,
    "medianResTime" : 43.0,
    "minResTime" : 27.0,
    "maxResTime" : 1111.0,
    "pct1ResTime" : 76.0,
    "pct2ResTime" : 85.94999999999999,
    "pct3ResTime" : 1054.71,
    "throughput" : 21.78649237472767,
    "receivedKBytesPerSec" : 435.83622685185185,
    "sentKBytesPerSec" : 4.765795206971678
  },
  "get_balance_for_coin_by_time 3" : {
    "transaction" : "get_balance_for_coin_by_time 3",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 148.79166666666669,
    "medianResTime" : 141.0,
    "minResTime" : 82.0,
    "maxResTime" : 1203.0,
    "pct1ResTime" : 173.0,
    "pct2ResTime" : 181.95,
    "pct3ResTime" : 1119.42,
    "throughput" : 9.878779147543684,
    "receivedKBytesPerSec" : 7128.262698347363,
    "sentKBytesPerSec" : 2.4504002963633744
  },
  "find_matching_accounts 8" : {
    "transaction" : "find_matching_accounts 8",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 154.65416666666655,
    "medianResTime" : 130.0,
    "minResTime" : 76.0,
    "maxResTime" : 1290.0,
    "pct1ResTime" : 240.0,
    "pct2ResTime" : 260.95,
    "pct3ResTime" : 487.66999999999797,
    "throughput" : 6.209171463682814,
    "receivedKBytesPerSec" : 3.0742675118038933,
    "sentKBytesPerSec" : 1.0672013453204836
  },
  "find_matching_accounts 3" : {
    "transaction" : "find_matching_accounts 3",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 149.80625000000006,
    "medianResTime" : 141.0,
    "minResTime" : 76.0,
    "maxResTime" : 318.0,
    "pct1ResTime" : 238.0,
    "pct2ResTime" : 261.9,
    "pct3ResTime" : 292.38,
    "throughput" : 6.196346737236172,
    "receivedKBytesPerSec" : 4.792486929581101,
    "sentKBytesPerSec" : 1.0286903762989736
  },
  "find_matching_accounts 2" : {
    "transaction" : "find_matching_accounts 2",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 166.90000000000015,
    "medianResTime" : 145.0,
    "minResTime" : 76.0,
    "maxResTime" : 1304.0,
    "pct1ResTime" : 255.80000000000007,
    "pct2ResTime" : 284.95,
    "pct3ResTime" : 1192.0,
    "throughput" : 6.194427596174941,
    "receivedKBytesPerSec" : 4.464343326149518,
    "sentKBytesPerSec" : 1.0223225231968407
  },
  "find_matching_accounts 5" : {
    "transaction" : "find_matching_accounts 5",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 153.6500000000001,
    "medianResTime" : 139.0,
    "minResTime" : 78.0,
    "maxResTime" : 1289.0,
    "pct1ResTime" : 238.90000000000003,
    "pct2ResTime" : 262.9,
    "pct3ResTime" : 308.38,
    "throughput" : 6.202111302055742,
    "receivedKBytesPerSec" : 5.1785206672438076,
    "sentKBytesPerSec" : 1.0417608827671754
  },
  "find_matching_accounts 4" : {
    "transaction" : "find_matching_accounts 4",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.0979166666667,
    "medianResTime" : 142.0,
    "minResTime" : 77.0,
    "maxResTime" : 1307.0,
    "pct1ResTime" : 241.80000000000007,
    "pct2ResTime" : 260.0,
    "pct3ResTime" : 465.6499999999981,
    "throughput" : 6.1984271491109135,
    "receivedKBytesPerSec" : 4.594341998217953,
    "sentKBytesPerSec" : 1.0350889086894202
  },
  "find_matching_accounts 1" : {
    "transaction" : "find_matching_accounts 1",
    "sampleCount" : 480,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 176.42291666666677,
    "medianResTime" : 144.5,
    "minResTime" : 85.0,
    "maxResTime" : 1571.0,
    "pct1ResTime" : 277.80000000000007,
    "pct2ResTime" : 306.95,
    "pct3ResTime" : 1159.75,
    "throughput" : 6.190752563358483,
    "receivedKBytesPerSec" : 4.111046624105243,
    "sentKBytesPerSec" : 1.0156703424260012
  }
}