tests/performance/result_report/statistics.json
{
  "get_balance_for_coin_by_block 1" : {
    "transaction" : "get_balance_for_coin_by_block 1",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11346.408333333336,
    "medianResTime" : 7736.0,
    "minResTime" : 6398.0,
    "maxResTime" : 22821.0,
    "pct1ResTime" : 19493.8,
    "pct2ResTime" : 19766.35,
    "pct3ResTime" : 22442.579999999987,
    "throughput" : 0.07433148124059243,
    "receivedKBytesPerSec" : 1.512398839499749,
    "sentKBytesPerSec" : 0.01626001152137959
  },
  "get_balance_for_coin_by_time 2" : {
    "transaction" : "get_balance_for_coin_by_time 2",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10048.324999999999,
    "medianResTime" : 6728.0,
    "minResTime" : 6343.0,
    "maxResTime" : 18063.0,
    "pct1ResTime" : 16920.7,
    "pct2ResTime" : 17086.899999999998,
    "pct3ResTime" : 18061.11,
    "throughput" : 0.07613044189915001,
    "receivedKBytesPerSec" : 60.74934182853902,
    "sentKBytesPerSec" : 0.018883918205453223
  },
  "get_balance_for_coin_by_time 1" : {
    "transaction" : "get_balance_for_coin_by_time 1",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10052.775000000005,
    "medianResTime" : 6700.0,
    "minResTime" : 6239.0,
    "maxResTime" : 19195.0,
    "pct1ResTime" : 16891.0,
    "pct2ResTime" : 17180.3,
    "pct3ResTime" : 19155.519999999997,
    "throughput" : 0.07609495889921032,
    "receivedKBytesPerSec" : 54.90808620702774,
    "sentKBytesPerSec" : 0.01887511675820256
  },
  "get_balance_for_coin_by_block 2" : {
    "transaction" : "get_balance_for_coin_by_block 2",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11159.424999999994,
    "medianResTime" : 7574.0,
    "minResTime" : 6427.0,
    "maxResTime" : 21711.0,
    "pct1ResTime" : 19525.600000000002,
    "pct2ResTime" : 19679.2,
    "pct3ResTime" : 21652.829999999998,
    "throughput" : 0.07445097062350826,
    "receivedKBytesPerSec" : 1.8137245245840208,
    "sentKBytesPerSec" : 0.016286149823892433
  },
  "find_matching_accounts 7" : {
    "transaction" : "find_matching_accounts 7",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.15000000000003,
    "medianResTime" : 109.0,
    "minResTime" : 84.0,
    "maxResTime" : 279.0,
    "pct1ResTime" : 194.0,
    "pct2ResTime" : 239.74999999999994,
    "pct3ResTime" : 273.7499999999998,
    "throughput" : 3.7562212414311205,
    "receivedKBytesPerSec" : 1.9074560991642409,
    "sentKBytesPerSec" : 0.6382641562588036
  },
  "get_balance_for_coin_by_block 5" : {
    "transaction" : "get_balance_for_coin_by_block 5",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10525.924999999996,
    "medianResTime" : 7342.5,
    "minResTime" : 5859.0,
    "maxResTime" : 18724.0,
    "pct1ResTime" : 18405.7,
    "pct2ResTime" : 18492.85,
    "pct3ResTime" : 18714.34,
    "throughput" : 0.07528008898106518,
    "receivedKBytesPerSec" : 1.5577979350671591,
    "sentKBytesPerSec" : 0.01698212944787701
  },
  "find_matching_accounts 6" : {
    "transaction" : "find_matching_accounts 6",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125.55833333333331,
    "medianResTime" : 108.5,
    "minResTime" : 87.0,
    "maxResTime" : 283.0,
    "pct1ResTime" : 187.8,
    "pct2ResTime" : 242.95,
    "pct3ResTime" : 278.79999999999984,
    "throughput" : 3.755280863714599,
    "receivedKBytesPerSec" : 3.0511657017681117,
    "sentKBytesPerSec" : 0.6344370990455328
  },
  "get_balance_for_coin_by_time 5" : {
    "transaction" : "get_balance_for_coin_by_time 5",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10094.541666666662,
    "medianResTime" : 6765.0,
    "minResTime" : 5825.0,
    "maxResTime" : 18157.0,
    "pct1ResTime" : 16827.2,
    "pct2ResTime" : 17033.1,
    "pct3ResTime" : 17983.329999999994,
    "throughput" : 0.07670716591951757,
    "receivedKBytesPerSec" : 55.55613873865293,
    "sentKBytesPerSec" : 0.01902697279644283
  },
  "get_balance_for_coin_by_block 3" : {
    "transaction" : "get_balance_for_coin_by_block 3",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10613.633333333337,
    "medianResTime" : 7463.0,
    "minResTime" : 6377.0,
    "maxResTime" : 19825.0,
    "pct1ResTime" : 19379.5,
    "pct2ResTime" : 19530.4,
    "pct3ResTime" : 19802.739999999998,
    "throughput" : 0.07516611711883263,
    "receivedKBytesPerSec" : 1.5322436804087032,
    "sentKBytesPerSec" : 0.016442588119744635
  },
  "get_balance_for_coin_by_time 4" : {
    "transaction" : "get_balance_for_coin_by_time 4",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9780.749999999996,
    "medianResTime" : 6714.0,
    "minResTime" : 6334.0,
    "maxResTime" : 17204.0,
    "pct1ResTime" : 16877.1,
    "pct2ResTime" : 16947.7,
    "pct3ResTime" : 17181.32,
    "throughput" : 0.07655121467639889,
    "receivedKBytesPerSec" : 54.63992461619135,
    "sentKBytesPerSec" : 0.01898828957793488
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2160,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5818.415277777788,
    "medianResTime" : 6515.5,
    "minResTime" : 84.0,
    "maxResTime" : 22821.0,
    "pct1ResTime" : 16881.8,
    "pct2ResTime" : 18466.699999999997,
    "pct3ResTime" : 19624.78,
    "throughput" : 1.3180343714074412,
    "receivedKBytesPerSec" : 277.55485574388393,
    "sentKBytesPerSec" : 0.26958493816222073
  },
  "find_matching_accounts 8" : {
    "transaction" : "find_matching_accounts 8",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 124.47500000000004,
    "medianResTime" : 109.0,
    "minResTime" : 85.0,
    "maxResTime" : 276.0,
    "pct1ResTime" : 209.30000000000004,
    "pct2ResTime" : 218.79999999999995,
    "pct3ResTime" : 271.5899999999998,
    "throughput" : 3.756691606924835,
    "receivedKBytesPerSec" : 1.8600025827254796,
    "sentKBytesPerSec" : 0.645681369940206
  },
  "get_balance_for_coin_by_time 3" : {
    "transaction" : "get_balance_for_coin_by_time 3",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10092.749999999996,
    "medianResTime" : 6914.5,
    "minResTime" : 6144.0,
    "maxResTime" : 18302.0,
    "pct1ResTime" : 16877.6,
    "pct2ResTime" : 17011.6,
    "pct3ResTime" : 18218.42,
    "throughput" : 0.07607879734637155,
    "receivedKBytesPerSec" : 54.896424462947095,
    "sentKBytesPerSec" : 0.018871107935525756
  },
  "get_balance_for_coin_by_block 4" : {
    "transaction" : "get_balance_for_coin_by_block 4",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9968.474999999999,
    "medianResTime" : 7080.5,
    "minResTime" : 5749.0,
    "maxResTime" : 18555.0,
    "pct1ResTime" : 18276.7,
    "pct2ResTime" : 18478.4,
    "pct3ResTime" : 18551.64,
    "throughput" : 0.07523477953388293,
    "receivedKBytesPerSec" : 1.5050629479996012,
    "sentKBytesPerSec" : 0.01645760802303689
  },
  "find_matching_accounts 3" : {
    "transaction" : "find_matching_accounts 3",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 130.45000000000016,
    "medianResTime" : 110.5,
    "minResTime" : 87.0,
    "maxResTime" : 296.0,
    "pct1ResTime" : 213.1000000000001,
    "pct2ResTime" : 266.0499999999998,
    "pct3ResTime" : 295.58,
    "throughput" : 3.7528146109582186,
    "receivedKBytesPerSec" : 2.9025675506629973,
    "sentKBytesPerSec" : 0.6230258631473605
  },
  "find_matching_accounts 2" : {
    "transaction" : "find_matching_accounts 2",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 135.62500000000003,
    "medianResTime" : 110.5,
    "minResTime" : 88.0,
    "maxResTime" : 289.0,
    "pct1ResTime" : 224.9,
    "pct2ResTime" : 273.0,
    "pct3ResTime" : 288.37,
    "throughput" : 3.753166734432177,
    "receivedKBytesPerSec" : 2.704918994151315,
    "sentKBytesPerSec" : 0.619419119256873
  },
  "find_matching_accounts 5" : {
    "transaction" : "find_matching_accounts 5",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 128.0583333333334,
    "medianResTime" : 108.0,
    "minResTime" : 87.0,
    "maxResTime" : 289.0,
    "pct1ResTime" : 217.0,
    "pct2ResTime" : 240.34999999999985,
    "pct3ResTime" : 287.31999999999994,
    "throughput" : 3.754223501439119,
    "receivedKBytesPerSec" : 3.1346299743461397,
    "sentKBytesPerSec" : 0.6305922287573521
  },
  "find_matching_accounts 4" : {
    "transaction" : "find_matching_accounts 4",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 128.06666666666658,
    "medianResTime" : 108.0,
    "minResTime" : 86.0,
    "maxResTime" : 294.0,
    "pct1ResTime" : 204.0,
    "pct2ResTime" : 233.69999999999993,
    "pct3ResTime" : 291.0599999999999,
    "throughput" : 3.7529319781078967,
    "receivedKBytesPerSec" : 2.7817142298670836,
    "sentKBytesPerSec" : 0.6267103205629397
  },
  "find_matching_accounts 1" : {
    "transaction" : "find_matching_accounts 1",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 150.08333333333337,
    "medianResTime" : 120.5,
    "minResTime" : 95.0,
    "maxResTime" : 1255.0,
    "pct1ResTime" : 239.10000000000005,
    "pct2ResTime" : 294.5999999999997,
    "pct3ResTime" : 1059.4899999999925,
    "throughput" : 3.7466046395454122,
    "receivedKBytesPerSec" : 2.4879796434481247,
    "sentKBytesPerSec" : 0.614677323675419
  }
}