tests/performance/result_report/statistics.json
{
  "get_balance_for_coin_by_block 1" : {
    "transaction" : "get_balance_for_coin_by_block 1",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10123.733333333334,
    "medianResTime" : 6978.5,
    "minResTime" : 6469.0,
    "maxResTime" : 18946.0,
    "pct1ResTime" : 17793.7,
    "pct2ResTime" : 18124.3,
    "pct3ResTime" : 18812.439999999995,
    "throughput" : 0.0795002086880478,
    "receivedKBytesPerSec" : 1.4233953379752622,
    "sentKBytesPerSec" : 0.023756898299358033
  },
  "get_balance_for_coin_by_time 2" : {
    "transaction" : "get_balance_for_coin_by_time 2",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9859.758333333337,
    "medianResTime" : 6622.5,
    "minResTime" : 5173.0,
    "maxResTime" : 17161.0,
    "pct1ResTime" : 16220.4,
    "pct2ResTime" : 16509.85,
    "pct3ResTime" : 17161.0,
    "throughput" : 0.07733025043401603,
    "receivedKBytesPerSec" : 3.3372836202930043,
    "sentKBytesPerSec" : 0.02582709535979832
  },
  "get_balance_for_coin_by_block 2" : {
    "transaction" : "get_balance_for_coin_by_block 2",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10101.824999999999,
    "medianResTime" : 7144.0,
    "minResTime" : 5914.0,
    "maxResTime" : 18665.0,
    "pct1ResTime" : 17736.1,
    "pct2ResTime" : 18034.75,
    "pct3ResTime" : 18645.05,
    "throughput" : 0.07952987241420217,
    "receivedKBytesPerSec" : 1.8100812563333946,
    "sentKBytesPerSec" : 0.023765762655025263
  },
  "get_balance_for_coin_by_time 1" : {
    "transaction" : "get_balance_for_coin_by_time 1",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10170.775000000001,
    "medianResTime" : 6560.0,
    "minResTime" : 5161.0,
    "maxResTime" : 18529.0,
    "pct1ResTime" : 16162.9,
    "pct2ResTime" : 16774.249999999996,
    "pct3ResTime" : 18481.329999999998,
    "throughput" : 0.07673105254542478,
    "receivedKBytesPerSec" : 3.0110943510599117,
    "sentKBytesPerSec" : 0.025626972627475854
  },
  "find_matching_accounts 7" : {
    "transaction" : "find_matching_accounts 7",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 199.6583333333334,
    "medianResTime" : 190.5,
    "minResTime" : 87.0,
    "maxResTime" : 470.0,
    "pct1ResTime" : 302.40000000000003,
    "pct2ResTime" : 368.39999999999964,
    "pct3ResTime" : 464.1199999999998,
    "throughput" : 2.540327702273593,
    "receivedKBytesPerSec" : 1.5579353486599772,
    "sentKBytesPerSec" : 0.6400435031119014
  },
  "get_balance_for_coin_by_block 5" : {
    "transaction" : "get_balance_for_coin_by_block 5",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9545.108333333339,
    "medianResTime" : 6951.5,
    "minResTime" : 5826.0,
    "maxResTime" : 18146.0,
    "pct1ResTime" : 17708.4,
    "pct2ResTime" : 18059.85,
    "pct3ResTime" : 18138.44,
    "throughput" : 0.07949599538923227,
    "receivedKBytesPerSec" : 1.4287541983822565,
    "sentKBytesPerSec" : 0.024221436095156708
  },
  "find_matching_accounts 6" : {
    "transaction" : "find_matching_accounts 6",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 199.4333333333334,
    "medianResTime" : 192.0,
    "minResTime" : 83.0,
    "maxResTime" : 388.0,
    "pct1ResTime" : 275.1,
    "pct2ResTime" : 307.79999999999995,
    "pct3ResTime" : 386.53,
    "throughput" : 2.5371051630090067,
    "receivedKBytesPerSec" : 2.47020883546873,
    "sentKBytesPerSec" : 0.6342762907522517
  },
  "get_balance_for_coin_by_time 5" : {
    "transaction" : "get_balance_for_coin_by_time 5",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9624.758333333333,
    "medianResTime" : 6489.0,
    "minResTime" : 5156.0,
    "maxResTime" : 17382.0,
    "pct1ResTime" : 15938.7,
    "pct2ResTime" : 16184.65,
    "pct3ResTime" : 17259.359999999997,
    "throughput" : 0.07810608368285805,
    "receivedKBytesPerSec" : 3.056510727870594,
    "sentKBytesPerSec" : 0.026086211542517047
  },
  "get_balance_for_coin_by_block 3" : {
    "transaction" : "get_balance_for_coin_by_block 3",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10028.441666666662,
    "medianResTime" : 7030.0,
    "minResTime" : 5709.0,
    "maxResTime" : 18493.0,
    "pct1ResTime" : 17835.2,
    "pct2ResTime" : 18040.3,
    "pct3ResTime" : 18464.44,
    "throughput" : 0.07957332781624928,
    "receivedKBytesPerSec" : 1.4388474002399136,
    "sentKBytesPerSec" : 0.023778748351340116
  },
  "get_balance_for_coin_by_time 4" : {
    "transaction" : "get_balance_for_coin_by_time 4",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9314.883333333335,
    "medianResTime" : 6489.5,
    "minResTime" : 5146.0,
    "maxResTime" : 16601.0,
    "pct1ResTime" : 16036.2,
    "pct2ResTime" : 16340.85,
    "pct3ResTime" : 16592.18,
    "throughput" : 0.07802974884174592,
    "receivedKBytesPerSec" : 3.0279200195074374,
    "sentKBytesPerSec" : 0.026060716898317484
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2160,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5545.729629629627,
    "medianResTime" : 6182.5,
    "minResTime" : 77.0,
    "maxResTime" : 19108.0,
    "pct1ResTime" : 15992.8,
    "pct2ResTime" : 17509.95,
    "pct3ResTime" : 18171.17,
    "throughput" : 1.3631613225694077,
    "receivedKBytesPerSec" : 22.75004721366039,
    "sentKBytesPerSec" : 0.39078474546748865
  },
  "find_matching_accounts 8" : {
    "transaction" : "find_matching_accounts 8",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 202.3666666666667,
    "medianResTime" : 189.5,
    "minResTime" : 81.0,
    "maxResTime" : 602.0,
    "pct1ResTime" : 298.9000000000001,
    "pct2ResTime" : 349.29999999999984,
    "pct3ResTime" : 563.1499999999985,
    "throughput" : 2.546473134708429,
    "receivedKBytesPerSec" : 1.5617042271454036,
    "sentKBytesPerSec" : 0.6440786541889483
  },
  "get_balance_for_coin_by_block 4" : {
    "transaction" : "get_balance_for_coin_by_block 4",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9997.099999999993,
    "medianResTime" : 7089.0,
    "minResTime" : 5927.0,
    "maxResTime" : 18780.0,
    "pct1ResTime" : 17878.3,
    "pct2ResTime" : 18169.1,
    "pct3ResTime" : 18743.039999999997,
    "throughput" : 0.07944794272862635,
    "receivedKBytesPerSec" : 1.378313186107468,
    "sentKBytesPerSec" : 0.023741279760702796
  },
  "get_balance_for_coin_by_time 3" : {
    "transaction" : "get_balance_for_coin_by_time 3",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9469.616666666661,
    "medianResTime" : 6482.5,
    "minResTime" : 5170.0,
    "maxResTime" : 19108.0,
    "pct1ResTime" : 16009.300000000001,
    "pct2ResTime" : 16290.3,
    "pct3ResTime" : 18617.019999999982,
    "throughput" : 0.07791256651785367,
    "receivedKBytesPerSec" : 3.0574595438998355,
    "sentKBytesPerSec" : 0.02602157983311128
  },
  "find_matching_accounts 3" : {
    "transaction" : "find_matching_accounts 3",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 194.10000000000008,
    "medianResTime" : 187.5,
    "minResTime" : 85.0,
    "maxResTime" : 414.0,
    "pct1ResTime" : 260.30000000000007,
    "pct2ResTime" : 319.54999999999967,
    "pct3ResTime" : 403.7099999999996,
    "throughput" : 2.5270073914966202,
    "receivedKBytesPerSec" : 2.3715372101838397,
    "sentKBytesPerSec" : 0.6243485059068797
  },
  "find_matching_accounts 2" : {
    "transaction" : "find_matching_accounts 2",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 201.6416666666667,
    "medianResTime" : 191.5,
    "minResTime" : 77.0,
    "maxResTime" : 485.0,
    "pct1ResTime" : 292.0,
    "pct2ResTime" : 318.6499999999999,
    "pct3ResTime" : 469.24999999999943,
    "throughput" : 2.52956428255233,
    "receivedKBytesPerSec" : 2.240541801049769,
    "sentKBytesPerSec" : 0.6225099601593626
  },
  "find_matching_accounts 5" : {
    "transaction" : "find_matching_accounts 5",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 186.975,
    "medianResTime" : 188.0,
    "minResTime" : 79.0,
    "maxResTime" : 351.0,
    "pct1ResTime" : 243.70000000000002,
    "pct2ResTime" : 306.84999999999997,
    "pct3ResTime" : 350.37,
    "throughput" : 2.53169898099116,
    "receivedKBytesPerSec" : 2.5316989809911603,
    "sentKBytesPerSec" : 0.6304523829616658
  },
  "find_matching_accounts 4" : {
    "transaction" : "find_matching_accounts 4",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 193.50000000000003,
    "medianResTime" : 189.0,
    "minResTime" : 79.0,
    "maxResTime" : 492.0,
    "pct1ResTime" : 282.8,
    "pct2ResTime" : 310.9,
    "pct3ResTime" : 468.0599999999991,
    "throughput" : 2.5287114108102413,
    "receivedKBytesPerSec" : 2.291644716046781,
    "sentKBytesPerSec" : 0.6272389632283216
  },
  "find_matching_accounts 1" : {
    "transaction" : "find_matching_accounts 1",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 209.4583333333334,
    "medianResTime" : 202.0,
    "minResTime" : 105.0,
    "maxResTime" : 467.0,
    "pct1ResTime" : 290.40000000000003,
    "pct2ResTime" : 344.95,
    "pct3ResTime" : 450.19999999999936,
    "throughput" : 2.5297775903868454,
    "receivedKBytesPerSec" : 2.0974425529672183,
    "sentKBytesPerSec" : 0.6200919679561505
  }
}